---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallSweepDefaultSetbackParam
source: html/64797b87-8025-cc17-152a-bc7b0fb92dab.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallSweepDefaultSetbackParam Property

"Default Setback"

## Syntax (C#)
```csharp
public static ForgeTypeId WallSweepDefaultSetbackParam { get; }
```